------------------Insert Customers----------------------------------
insert Customers values('陳雁琪', '1994-08-08', '台南市南區', '0911111111', 'aa123456', 'aa123456'),
										('黃玉泉', '1995-09-07', '台南市歸仁區', '0922222222',  'bb123456', 'bb123456'),
										('陳辰祐', '1998-12-07', '台南市東區', '0933333333',  'cc123456', 'cc123456'),
										('林書豪', '1990-01-24', '台南市中西區', '0944444444',  'dd123456', 'dd123456'),
										('鄭重製', '1996-02-08', '台南市歸仁區', '0955555555',  'ee123456', 'ee123456'),
										('沈燕轟', '1993-11-17',  '台南市東區', '0934343434', 'ff123456', 'ff123456'),
										('品和', null, null, '0966666666','gg123456', 'gg123456'),
										('張嘉明', '1985-06-16',  '台南市中西區', '0945454545', 'hh123456', 'hh123456');
go

------------------Insert Employees----------------------------------
insert Employees values('張嘉明', '1985-06-16', '2015-06-06', '台南市中西區', '0945454545', 'e20150606', 'e1234567',  'Boss'),
										('劉加順', '1989-05-13', '2016-06-01', '台南市仁德區', '0923232323', 'e20160601', 'e1234567',  'CEO'),
										('沈燕轟', '1993-11-17', '2016-11-13', '台南市東區', '0934343434', 'e20161113', 'e1234567',  'Staff'),
										('林滿衝', '1991-07-09', '2021-08-09', '台南市南區', '0912121212', 'e20210809', 'e1234567', 'Staff');
go
--alter table Employees
--add Account varchar(30)not null,

------------------Insert Products----------------------------------
insert Products values('起司蛋', 'Sub', 1, '好吃的起司潛艇堡', 80, 'Sub_CheeseEgg.png', 0),
									('鷹嘴豆泥餅', 'Sub', 1, '好吃的鷹嘴豆泥餅潛艇堡', 90, 'Sub_Falafel.png', 0),
									('燒烤牛肉', 'Sub',  1,'好吃的燒烤牛肉潛艇堡', 100, 'Sub_RoastBeef.png', 1),
									('活跳跳蝦', 'Sub',  1,'好吃的活跳跳蝦潛艇堡', 110, 'Sub_Shrimp.png', 0),
									('吃素專用', 'Sub',  1,'好吃的吃素專用潛艇堡', 85, 'Sub_Vagetable.png', 0),
									('培根蛋餅', 'EggCake',  2,'好吃的培根蛋餅', 35 ,'EggCake_Bacon.png', 0),
									('燻雞蛋餅', 'EggCake',  2,'好吃的燻雞蛋餅', 35 ,'EggCake_Chicken.png', 0),
									('玉米蛋餅', 'EggCake',  2,'好吃的玉米蛋餅', 30 ,'EggCake_Corn.png', 0),
									('鮪魚蛋餅', 'EggCake',  2,'好吃的鮪魚蛋餅', 35 ,'EggCake_Fish.png', 0),
									('里肌蛋餅', 'EggCake',  2,'好吃的里肌蛋餅', 45 ,'EggCake_Pig.png', 0),
									('雞米花', 'Single',  3,'好吃的雞米花', 30, 'Single_ChickenPopcorn.png', 0),
									('玉米濃湯', 'Single', 3,'好喝的玉米濃湯', 30, 'Single_CornSoup.png', 0),
									('煎餃', 'Single', 3, '好吃的煎餃', 40, 'Single_dumpling.png', 1),
									('煎蛋', 'Single', 3, '好吃的煎蛋', 15, 'Single_FriedEgg.png', 0),
									('薯餅', 'Single', 3, '好吃的薯餅', 20, 'Single_PotatoCake.png', 0),
									('可可亞', 'Drink', 4, '好喝的可可亞', 25, 'Drink_Cocoa.png', 0),
									('拿鐵', 'Drink', 4, '好喝的拿鐵', 35, 'Drink_CoffeeMilk.png', 0),
									('超級鮮奶茶', 'Drink', 4, '好喝的超級鮮奶茶', 25, 'Drink_MilkTea.png', 1),
									('紅茶', 'Drink', 4, '好喝的紅茶', 25, 'Drink_RedTea.png', 0),
									('濃濃豆漿', 'Drink', 4, '好喝的濃濃豆漿', 25, 'Drink_SoyMilk.png', 0);
go